[
    {
        "date": "2024-12-01",
        "titre": "Pharaon",
        "teaser":"Une refonte totale du site Web 'Pharaon Magazine' développé en Drupal au début des années 2010. Le front s'articule dorévanant autour de Vue.js, Vue-router, des composants UI PrimeVue, Pinia ou encore VeeValidate/Yup ; le back, en mode serverless, utilise Turso, Sendgrid, Cloudinary et Auth0.",
        "technos": "Vue.js",
        "url": "https://www.pharaon-magazine.fr"
    },
    {
        "date": "2024-09-03",
        "titre": "Kikō",
        "teaser":"Cet outil permet de visualiser une sélection de données climatiques et environnementales, issues de l'open data : température moyenne, température minimale, température maximale, ensoleillement, précipitations, rafales de vent, distance de la centrale nucléaire la plus proche, prix moyen au m2 des maisons. Les valeurs annuelles affichées sont, à date, moyennées sur la période 1991-2020 (hors records climatiques).",
        "technos": "Vue.js",
        "url": "https://kiko.andretonic.fr"
    },
    {
        "date": "2024-12-31",
        "titre": "WebCheck'CAC40",
        "teaser":"Découvrez les mesures effectuées tout au long de l'année 2024 sur les sites institutionnels des sociétés du CAC40, via l'utilisation de l'API Google Lighthouse.",
        "technos": "Vue.js",
        "url": "https://webcheckcac40.andretonic.fr"
    },
    {
        "date": "2024-05-04",
        "titre": "Botanicalparis.com",
        "teaser":"Ce démonstrateur technique a été développé pour démontrer la performance du framework vue.js versus WordPress, sur les indicateurs Lighthouse de Google.",
        "technos": "Vue.js",
        "url": "https://jazzy-florentine-dc0c2d.netlify.app/"
    },
    {
        "date": "2023-12-30",
        "titre": "Speedlify",
        "teaser":"Zach Leatherman a automatisé les tests Lighthouse fournis par Google, afin de suivre la performance de sites Web dans le temps. Une instantiation est mise à disposition sur les sites de l'indice CAC40. Plus le score global approche les 400 points, meilleur est le site en termes de performance, accessibilité, bonnes pratiques et SEO. PROJET PLUS MAINTENU ET REMPLACÉ PAR WEBCHECK'CAC40.",
        "technos": "11ty",
        "url": "https://speedlifycac40.andretonic.fr"
    }
]